function fp=set_FP_parameters(p)
%function [a,b,az,fp]=set_FP_parameters(p)

%-------------------------------------------------
%									[output parameters]
%	a,b	:	FP定数
%	az	:	センサの深度 [unit:m]
%
%	o_x0:	FP中心のVICON座標系における位置(x)		[unit:m]
%	o_y0:	FP中心のVICON座標系における位置(y)		[unit:m]
%
%	fp.corner(1~4).xyz: FPコーナーの座標値			[unit:m]
%
%	Sx/Sy/Sz: FP係数(FP固有)
%			FP1(new)
%		4---------1
%		|					|
%		|		 o		|	600
%		|					|
%		3---------o
%		2		900
%								 x
%								 ↑
%							y←○
%-------------------------------------------------

fp(1).a	=0.21;
fp(1).b	=0.35;
fp(1).az=-0.069;		%taraflexの厚み0.012m(17mm)をプラス	！

fp(2).a	=0.21;
fp(2).b	=0.35;
fp(2).az=-0.069;

fp(3).a	=0.21;
fp(3).b	=0.35;
fp(3).az=-0.069;

fp(4).a	=0.21;
fp(4).b	=0.35;
fp(4).az=-0.069;

% 	fp(2).a	=0.21;
% 	fp(2).b	=0.35;
% 	fp(2).az=-0.064;		%taraflexの厚み0.012m(12mm)をプラス	！

%	fp(3).a	=0.21;
%	fp(3).b	=0.35;
%	fp(3).az=-0.077;		%サーフェスの厚み0.025m(25mm)をプラス	！

%	a	=0.21;
%	b	=0.35;
%	az=-0.045;

%	fp(1).Sx=3.67;	%	FP1
%	fp(1).Sy=3.68;	%	FP1
%	fp(1).Sz=3.83;	%	FP1
% %
% fp(2).Sx=7.646;	%	FP2
% fp(2).Sy=7.643;	%	FP2
% fp(2).Sz=3.884;	%	FP2

fp(2).S(1) = 7.646;%	FP2
fp(2).S(2) = 7.646;
fp(2).S(3) = 7.643;
fp(2).S(4) = 7.643;
fp(2).S(5) = 3.884;
fp(2).S(6) = 3.884;
fp(2).S(7) = 3.884;
fp(2).S(8) = 3.884;

fp(1).S(1) = 3.67;  %	FP4
fp(1).S(2) = 3.67;
fp(1).S(3) = 3.68;
fp(1).S(4) = 3.68;
fp(1).S(5) = 3.83;
fp(1).S(6) = 3.83;
fp(1).S(7) = 3.83;
fp(1).S(8) = 3.83;

fp(3).S(1) = 7.610;   %	FP3
fp(3).S(2) = 7.610;
fp(3).S(3) = 7.621;
fp(3).S(4) = 7.621;
fp(3).S(5) = 3.862;
fp(3).S(6) = 3.862;
fp(3).S(7) = 3.862;
fp(3).S(8) = 3.862;

fp(4).S(1) = 7.680;   %	FP3
fp(4).S(2) = 7.680;
fp(4).S(3) = 7.670;
fp(4).S(4) = 7.670;
fp(4).S(5) = 3.883;
fp(4).S(6) = 3.883;
fp(4).S(7) = 3.883;
fp(4).S(8) = 3.883;

fp(5).S(1) = 3.818;   %	FP amp
fp(5).S(2) = 3.802;
fp(5).S(3) = 3.820;
fp(5).S(4) = 3.804;
fp(5).S(5) = 1.933;
fp(5).S(6) = 1.942;
fp(5).S(7) = 1.943;
fp(5).S(8) = 1.943;


% fp(1).Sx=3.67;	%	FP4
% fp(1).Sy=3.68;	%	FP4
% fp(1).Sz=3.83;	%	FP4

% fp(3).Sx=7.610;	%	FP3
% fp(3).Sy=7.621;	%	FP3
% fp(3).Sz=3.862;	%	FP3

% fp(4).Sx=7.680;	%	FP3
% fp(4).Sy=7.670;	%	FP3
% fp(4).Sz=3.883;	%	FP3


% 	fp(1).corner(1).xyz=[0 1803 0];
% 	fp(1).corner(2).xyz=[600 1803 0];
% 	fp(1).corner(3).xyz=[600 903 0];
% 	fp(1).corner(4).xyz=[0 903 0];
%
% 	fp(1).o_x0=0.3;
% 	fp(1).o_y0=1.353;

fp(1).corner(1).xyz=[0 900 0];
fp(1).corner(2).xyz=[600 900 0];
fp(1).corner(3).xyz=[600 0 0];
fp(1).corner(4).xyz=[0 0 0];

fp(1).o_x0=0;
fp(1).o_y0=0;

%     fp(2).corner(1).xyz=[0 900 0];
% 	fp(2).corner(2).xyz=[600 900 0];
% 	fp(2).corner(3).xyz=[600 0 0];
% 	fp(2).corner(4).xyz=[0 0 0];
%
% 	fp(2).o_x0=0.3;
% 	fp(2).o_y0=0.45;


return;